In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
df1 = pd.read_csv(f"/Users/folder_01/Git_tutorial/data_jobs.xlsx - Sheet1.csv")

## EDA part

In [4]:
df1.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills
0,Senior Data Scientist,Senior Data Scientist Data and Analytics Perfo...,"Bennington, NE",via ZipRecruiter,Full-time,False,Sudan,2023-04-24 09:51:15,False,True,Sudan,year,128050.0,NaN,Cox Communications,"['sql', 'python', 'aws', 'pyspark', 'tableau',..."
1,Data Engineer,Data Engineer - MA,"Mesa, AZ",via Indeed,Full-time,False,Georgia,2023-03-13 12:51:23,True,True,United States,year,140000.0,NaN,Worldgate LLC,"['sql', 'nosql', 'java', 'python', 'kafka', 's..."
2,Senior Data Analyst,Supervisory Information Technology Specialist ...,"Alexandria, VA",via ZipRecruiter,Full-time,False,"New York, United States",2023-07-05 07:03:38,True,False,United States,year,156000.0,NaN,National Technical Information Service,NaN
3,Machine Learning Engineer,Machine Learning Research Scientist,"Pittsburgh, PA",via Ai-Jobs.net,Full-time,False,"Illinois, United States",2023-04-13 16:05:41,False,True,United States,year,140000.0,NaN,Bosch Group,"['pytorch', 'tensorflow']"
4,Data Scientist,"Data Scientist, AWS","Irving, TX",via Snagajob,Full-time and Part-time,False,"Texas, United States",2023-10-15 06:02:51,False,False,United States,hour,NaN,39.795002,"Presidio, Inc.","['python', 'r', 'sql', 'c', 'aws', 'gcp', 'big..."

In [5]:
df1.tail()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills
32667,Senior Data Scientist,Senior Data Scientist,"Palo Alto, CA",via Indeed,Full-time,False,"California, United States",2023-08-29 18:05:55,False,True,United States,year,191000.0,NaN,Navan,"['go', 'python', 'sql', 'numpy', 'pandas', 'te..."
32668,Data Analyst,eCommerce Data Analyst | Hybrid Work | W2 Acce...,"Austin, TX",via LinkedIn,Contractor,False,"Texas, United States",2023-03-15 19:01:41,False,False,United States,hour,NaN,42.5,"TalentBurst, an Inc 5000 company","['python', 'excel']"
32669,Data Scientist,Clinical Data Visualization Specialist - Remote,Anywhere,via ZipRecruiter,Full-time,True,"California, United States",2023-12-18 16:02:34,False,True,United States,hour,NaN,55.0,Avispa Technology,"['sas', 'sas', 'python']"
32670,Data Analyst,Data Analyst/Report Writer 2,"Austin, TX",via Adzuna,Full-time,False,"Texas, United States",2023-05-04 07:01:58,True,False,United States,hour,NaN,55.0,My3Tech,"['sas', 'sas', 'word', 'excel', 'sharepoint']"
32671,Data Scientist,Data Science Product Manager - Recommendations...,"Prague, Czechia",via Ai-Jobs.net,Full-time,False,Czechia,2023-03-31 20:02:52,False,False,Czechia,year,89100.0,NaN,Zeta Global,NaN

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32672 entries, 0 to 32671
Data columns (total 16 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   job_title_short        32672 non-null  object
 1   job_title              32672 non-null  object
 2   job_location           32317 non-null  object
 3   job_via                32662 non-null  object
 4   job_schedule_type      32531 non-null  object
 5   job_work_from_home     32672 non-null  bool
 6   search_location        32672 non-null  object
 7   job_posted_date        32672 non-null  object
 8   job_no_degree_mention  32672 non-null  bool
 9   job_health_insurance   32672 non-null  bool
 10  job_country            32672 non-null  object
 11  salary_rate            32672 non-null  object
 12  salary_year_avg        22036 non-null  float64
 13  salary_hour_avg        10636 non-null  float64
 14  company_name           32672 non-null  object
 15  job_skills             29485 non-null  object
dtypes: bool(3), float64(2), object(11)
memory usage: 3.3+ MB

In [7]:
df1.describe()

       salary_year_avg  salary_hour_avg
count     22036.000000     10636.000000
mean     123192.041852        47.028800
std       48239.188733        21.847505
min       15000.000000         8.000000
25%       90000.000000        27.500000
50%      115000.000000        46.000000
75%      150000.000000        61.159996
max      960000.000000       391.000000

In [8]:
non_numeric_columns = df1.select_dtypes(include=['object', 'bool']).columns
non_numeric_stats = []

for col in non_numeric_columns:
    unique_values = df1[col].nunique()
    most_frequent_value = df1[col].mode()[0] if not df1[col].mode().empty else None
    most_frequent_count = df1[col].value_counts().iloc[0] if not df1[col].value_counts().empty else None
    non_numeric_stats.append([col, unique_values, most_frequent_value, most_frequent_count])

# Create a DataFrame for better readability
non_numeric_stats_df = pd.DataFrame(non_numeric_stats, columns=["Column", "Unique Values", "Most Frequent Value", "Frequency"])
non_numeric_stats_df

                   Column  Unique Values      Most Frequent Value  Frequency
0         job_title_short             10             Data Analyst       9606
1               job_title          15285             Data Analyst       2375
2            job_location           2574                 Anywhere       5960
3                 job_via            595             via LinkedIn       6394
4       job_schedule_type             26                Full-time      25126
5      job_work_from_home              2                    False      26712
6         search_location            116  New York, United States       6226
7         job_posted_date          31767      2023-01-03 23:35:29          8
8   job_no_degree_mention              2                    False      26441
9    job_health_insurance              2                    False      20442
10            job_country            111            United States      25141
11            salary_rate              2                     year      22036
12           company_name           9967                   Upwork        729
13             job_skills          15618                ['excel']        529

In [9]:
# Calculate descriptive statistics for numeric columns
# Specifically, include count, mean, standard deviation, min, 25th percentile, median, 75th percentile, and max

numeric_columns = df1.select_dtypes(include=['float64', 'int64']).columns
numeric_stats_df = df1[numeric_columns].describe().transpose().reset_index()

# Rename columns for better readability
numeric_stats_df.columns = [
    "Column", "Count", "Mean", "Standard Deviation", "Min", 
    "25th Percentile", "Median", "75th Percentile", "Max"
]
numeric_stats_df

,Column,Count,Mean,Standard Deviation,Min,25th Percentile,Median,75th Percentile,Max
0,salary_year_avg,22036.0,123192.041852,48239.188733,15000.0,90000.0,115000.0,150000.000000,960000.0
1,salary_hour_avg,10636.0,47.028800,21.847505,8.0,27.5,46.0,61.159996,391.0

## Data Cleaning part

In [14]:
# Checking duplicated data and remove it our dataset

# Check for duplicates
duplicates = df1.duplicated()
print("Number of duplicated rows:", duplicates.sum())

# Display duplicated rows if any
if duplicates.sum() > 0:
    print("Duplicated rows:")
    df1[duplicates]

# Remove duplicates
data_cleaned = df1.drop_duplicates()
print("Shape after removing duplicates:", data_cleaned.shape)

Number of duplicated rows: 1
Duplicated rows:
Shape after removing duplicates: (32671, 16)